let i = 0;
// 1.Виведіть парні числа від 2 до 10, використовуючи цикл for.
// for (i; i<=10; i++) {
//     if(i % 2 == 0 ) continue;
//     i++
//     console.log(i);
// }

// 2.Замініть цикл for на while так, щоб поведінка не змінилася (щоб вивід залишився той самий).
// for (let i = 0; i < 3; i++) { console.log( `число ${i}!` ); }

// while (i<3) {
//     console.log(`число ${i}!`)
//     i++
// }

// 3. Напишіть цикл, який пропонує prompt ввести число більше за 100. Якщо відвідувач введе інше число – попросити ввести ще раз, і так далі.
// Цикл повинен запитувати число доти, доки відвідувач не введе число, більше за 100, або не скасує ввід/введе порожній рядок.
// Ми припускаємо, що відвідувач вводитиме лише числа. В цьому завданні не обов’язково реалізовувати оброблення не-числового введення.

// for (i; i<=100; i++){
//     let value = prompt('Enter a number greater than 100', 10);
//     if (value < 100 && value) {
//         i++;
//     } else {
//         console.log(value)
//         break
//     }
// }

// 4.Вивести прості числа
// Просте число – це натуральне число, яке має два дільники (1 і саме число).
// Інакше кажучи, n > 1 – просте, якщо воно більше за 1 і ділиться без остачі на 1 та n.
// Наприклад, число 5 – просте, тому що воно не ділиться без остачі на 2, 3 і 4. Воно ділиться без остачі лише на 1 і на 5.
// Напишіть код, який виводить всі прості числа в діапазоні від 2 до n.Для n = 10 результат повинен бути 2,3,5,7.
// P.S. Код також повинен легко модифікуватися для будь-якого числа n.